function setGeneralModePool(){
    var pool = new Array(); // 15
    pool[0] = "我寄愁心与明月，随君直到夜郎西";
    pool[1] = "人生得意须尽欢，莫使金樽空对月";
    pool[2] = "且就洞庭赊月色，将船买酒白云边";
    pool[3] = "会当凌绝顶，一览众山小";
    pool[4] = "两个黄鹂鸣翠柳，一行白鹭上青天";
    pool[5] = "艰难苦恨繁霜鬓，潦倒新停浊酒杯";
    pool[6] = "最是一年春好处，绝胜烟柳满皇都";
    pool[7] = "业精于勤荒于嬉，行成于思毁于随";
    pool[8] = "云横秦岭家何在，雪拥蓝关马不前";
    pool[9] = "战士军前半死生，美人帐下犹歌舞";
    pool[10] = "莫愁前路无知己，天下谁人不识君";
    pool[11] = "一卧东山三十春，岂知书剑老风尘";
    pool[12] = "儿童相见不相识，笑问客从何处来";
    pool[13] = "不知细叶谁裁出，二月春风似剪刀";
    pool[14] = "莫谩愁沽酒，囊中自有钱";
    pool[15] = "气蒸云梦泽，波撼岳阳城";
    pool[16] = "野旷天低树，江清月近人";
    pool[17] = "欲寻芳草去，惜与故人违";
    pool[18] = "空山新雨后，天气晚来秋";
    pool[19] = "红豆生南国，春来发几枝";
    pool[20] = "九天阊阖开宫殿，万国衣冠拜冕旒";
    pool[21] = "阁中帝子今何在，槛外长江空自流";
    pool[22] = "闲云潭影日悠悠，物换星移几度秋";
    pool[23] = "落霞与孤鹜齐飞，秋水共长天一色";
    pool[24] = "海内存知己，天涯若比邻";
    pool[25] = "明月沉珠浦，秋风濯锦川";
    pool[26] = "无人信高洁，谁为表予心";
    pool[27] = "露重飞难进，风多响易沉";
    pool[28] = "白毛浮绿水，红掌拨清波";
    pool[29] = "不求生入塞，唯当死报君";
    pool[30] = "旧时王谢堂前燕，飞入寻常百姓家";
    pool[31] = "晴空一鹤排云上，便引诗情到碧霄";
    pool[32] = "东边日出西边雨，道是无晴却有晴";
    

    var pick = new Array();
    var randoms = getRandomIndex(pool.length);
    for (var i = 0; i < randoms.length; i++) {
        var num = randoms[i];
        pick[i] = pool[num];
    }

    return generateRoundPool(pick);
}